In [1]:
import pandas as pd

In [3]:
import pandas as pd 
dict1={'Name':['tanisha','virat','shreya','aryaman','anushka','shubh','anjali'],
      'Marks':[98,93,89,78,91,83,99],
      'Gender':['female','male','female','male','female','male','female'],
     }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  tanisha     98  female
1    virat     93    male
2   shreya     89  female
3  aryaman     78    male
4  anushka     91  female
5    shubh     83    male
6   anjali     99  female

In [4]:
df1.head(4)

      Name  Marks  Gender
0  tanisha     98  female
1    virat     93    male
2   shreya     89  female
3  aryaman     78    male

In [5]:
df1.head(3)

      Name  Marks  Gender
0  tanisha     98  female
1    virat     93    male
2   shreya     89  female

In [6]:
df1.tail(3
    )

      Name  Marks  Gender
4  anushka     91  female
5    shubh     83    male
6   anjali     99  female

In [8]:
df1.shape

(7, 3)

In [10]:
print('number of rows:',df1.shape[0])
print('number of columns:',df1.shape[1])

number of rows: 7
number of columns: 3

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [12]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [13]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [14]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [17]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     tanisha        NaN  female
freq          1        NaN       4
mean        NaN  90.142857     NaN
std         NaN   7.625146     NaN
min         NaN  78.000000     NaN
25%         NaN  86.000000     NaN
50%         NaN  91.000000     NaN
75%         NaN  95.500000     NaN
max         NaN  99.000000     NaN

In [25]:
df1['Gender'].unique()

array(['female', 'male'], dtype=object)

In [26]:
df1['Gender'].nunique()

2

In [28]:
df1['Gender'].value_counts()

female    4
male      3
Name: Gender, dtype: int64

In [31]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  tanisha     98  female
1    virat     93    male
4  anushka     91  female
6   anjali     99  female

In [32]:
(df1['Marks']>=90) & (df1['Marks']<=100)

0     True
1     True
2    False
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [34]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  tanisha     98  female
1    virat     93    male
4  anushka     91  female
6   anjali     99  female

In [35]:

len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [36]:
df1['Marks'].between(90,100)

0     True
1     True
2    False
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [38]:
sum(df1['Marks'].between(90,100))

4

In [39]:
df1['Marks'].mean()

90.14285714285714

"apply method"

In [40]:
def Marks(x):
    return x/2

In [47]:
df1['Half_Marks']=df1['Marks'].apply(Marks)

In [48]:
df1

      Name  Marks  Gender  Half_Marks
0  tanisha     98  female        49.0
1    virat     93    male        46.5
2   shreya     89  female        44.5
3  aryaman     78    male        39.0
4  anushka     91  female        45.5
5    shubh     83    male        41.5
6   anjali     99  female        49.5

In [50]:
df1['Name'].apply(len)

0    7
1    5
2    6
3    7
4    7
5    5
6    6
Name: Name, dtype: int64

In [59]:
df1['Gender'].map({'male':1,'female':0})

0    0
1    1
2    0
3    1
4    0
5    1
6    0
Name: Gender, dtype: int64

In [60]:
df1['binary_mf']=df1['Gender'].map({'male':1,'female':0})

In [61]:
df1

      Name  Marks  Gender  Half_Marks  binary_mf
0  tanisha     98  female        49.0          0
1    virat     93    male        46.5          1
2   shreya     89  female        44.5          0
3  aryaman     78    male        39.0          1
4  anushka     91  female        45.5          0
5    shubh     83    male        41.5          1
6   anjali     99  female        49.5          0

In [65]:
df1.drop('binary_mf',axis=1)

      Name  Marks  Gender  Half_Marks
0  tanisha     98  female        49.0
1    virat     93    male        46.5
2   shreya     89  female        44.5
3  aryaman     78    male        39.0
4  anushka     91  female        45.5
5    shubh     83    male        41.5
6   anjali     99  female        49.5

In [66]:
df1.drop(['binary_mf','Half_Marks'],axis=1)

      Name  Marks  Gender
0  tanisha     98  female
1    virat     93    male
2   shreya     89  female
3  aryaman     78    male
4  anushka     91  female
5    shubh     83    male
6   anjali     99  female

In [68]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'binary_mf'], dtype='object')

In [69]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [71]:
df1.sort_values(by='Marks')

      Name  Marks  Gender  Half_Marks  binary_mf
3  aryaman     78    male        39.0          1
5    shubh     83    male        41.5          1
2   shreya     89  female        44.5          0
4  anushka     91  female        45.5          0
1    virat     93    male        46.5          1
0  tanisha     98  female        49.0          0
6   anjali     99  female        49.5          0

In [74]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender  Half_Marks  binary_mf
6   anjali     99  female        49.5          0
0  tanisha     98  female        49.0          0
1    virat     93    male        46.5          1
4  anushka     91  female        45.5          0
2   shreya     89  female        44.5          0
5    shubh     83    male        41.5          1
3  aryaman     78    male        39.0          1

In [79]:
df1[df1['Gender'] =='female']

      Name  Marks  Gender  Half_Marks  binary_mf
0  tanisha     98  female        49.0          0
2   shreya     89  female        44.5          0
4  anushka     91  female        45.5          0
6   anjali     99  female        49.5          0

In [85]:
df1[df1['Gender'] =='female'][['Name','Marks']]

      Name  Marks
0  tanisha     98
2   shreya     89
4  anushka     91
6   anjali     99

In [100]:
df1[df1['Gender'].isin(['female'])][['Name','Marks']]

      Name  Marks
0  tanisha     98
2   shreya     89
4  anushka     91
6   anjali     99

In [101]:
pwd

'C:\\Users\\tanis'